{
  "name": "Mosa (Plantain Puff Puff)",
  "description": "Plantain Mosa is overripe plantains mashed and mixed with other ingredients then deep-fried in vegetable oil. This version of Plantain Mosa is similar to Nigerian Puff Puff. Now, don't fret at the mention of Puff Puff because this is not as challenging as Puff Puff.",
  "top image": "https://www.notion.so/ebosetale/Mosa-Plantain-Puff-Puff-75dcd7dacda0412f9d5e5d3247a9c4f2#0790b5f9567b4846bec433f7ee0fbfed",
  "ingredients": [
    {
      "name": "Plantain",
      "quantity": 1,
      "type": "over-riped"
    },
    {
      "name": "Flour",
      "type": "Plain",
      "quantity": "3 heaped Tbs"
    },
    {
      "name": "Yeast",
      "quantity": "2Tsp"
    },
    {
      "name": "Water",
      "quantity": "8Tbs",
      "type": "warm"
    },
    {
      "name": "Black Pepper",
      "quantity": "To taste"
    },
    {
      "name": "Salt",
      "quantity": "To taste"
    },
    {
      "name": "Vegetable oil",
      "quantity": "For frying"
    }
  ],
  "notes": [
    "The following ingredients give 16 medium balls of Plantain Mosa",
    "The vegetable oil should be about 3 inches deep when poured into the pot.",
    "You can use cayenne pepper (fresh or dry) in the absence of Habanero pepper. The dry one needs to be ground into powder before use."
  ],
  "steps": [
    "Mix the fast action yeast with the warm water making sure there are no lumps. Cover and set aside.",
    "Peel the overripe plantain and mash with a fork till a good blend is achieved. Set aside.",
    "Sift the plain flour and the salt into a sizeable bowl. Mix thoroughly.",
    "Add the yeast solution and stir till you get a medium consistency. If it is too thick, add a few more tablespoons of warm water and mix till you get a medium consistency.",
    "Add the mashed plantain. Mix with a spatula till well incorporated.",
    "Cover with aluminium foil. Leave in a warm place to rest for 10-15 minutes.",
    "After that time, you'll notice that it a bit fluffy.",
    "Beat the batter with a spoon then add the black pepper (cut into pieces). You can also use cayenne pepper.",
    "Heat some vegetable oil in a pot. The oil should be about 3 inches deep. The oil is hot enough when a small quantity of batter dropped into the oil sizzles and quickly comes to the surface of the oil.",
    "Scoop small amounts of the batter into the oil using your finger tips. Watch as they sizzle, come up to the surface of the oil and puff up.",
    "Stir constantly till golden. Reduce the heat if you think the plantain mosas are browning too quickly. This is to ensure that the inside is well cooked by the time the outside browns.",
    "When done, transfer to a paper-lined sieve to drain. That's it!\n\nServe with a chilled drink. Yummyyyyy!"
  ],
  "bottom image": "https://www.notion.so/ebosetale/Mosa-Plantain-Puff-Puff-75dcd7dacda0412f9d5e5d3247a9c4f2#1eeb689001fb4926b6c3fe4e7a7bd0df"
}