{
  "name": "Samosa",
  "description": "A samosa is a fried or baked dish with a savoury filling, such as spiced potatoes, onions, peas, lentils, macaroni, noodles, cheese, minced lamb or minced beef. It is typically in a triangular shape. Samosa is an Indian delicacy but Nigerians love it so much!",
  "top image": "https://guardian.ng/wp-content/uploads/2017/08/maxresdefault-15-e1503561552992.jpg",
  "ingredients": [
    {
      "dough": [
        {
          "name": "Flour",
          "quantity": "120g"
        },
        {
          "name": "Vegetable oil",
          "quantity": "3Tsp"
        },
        {
          "name": "Salt",
          "quantity": "A pinch"
        },
        {
          "name": "Seasoning spice",
          "quantity": "Half tsp"
        },
        {
          "name": "water",
          "quantity": "As required"
        }
      ]
    },
    {
      "filling": [
        {
          "name": "Irish potatoes",
          "quantity": 2
        },
        {
          "name": "Green peas",
          "quantity": "2 handfuls"
        },
        {
          "name": "Carrot",
          "quantity": 1
        },
        {
          "name": "Beef or Meat",
          "quantity": "200g",
          "type": "minced"
        },
        {
          "name": "vegetable oil",
          "quantity": "2 cooking spoons"
        },
        {
          "name": "Stock Cubes",
          "quantity": "As required"
        },
        {
          "name": "Spring Onion",
          "quantity": "1 stalk",
          "type": "sliced"
        },
        {
          "name": "curry",
          "quantity": "1tsp"
        },
        {
          "name": "Garlic",
          "quantity": "1 pinch",
          "type": "powder"
        }
      ]
    }
  ],
  "steps": [
    {
      "make the dough": [
        { "action": [
            "In a large bowl, add flour, thyme salt and mix well.\n",
            "Add the oil and then start mixing with your fingers.\n",
            "Rub the flour with the oil until the oil is well incorporated in all of the flour. Do this for 3 to 4 minutes, you don’t want to rush this step.\n",
            "Once incorporated, the mixture resembles crumbs.\n"
          ],
          "image": "https://www.cookwithmanali.com/wp-content/uploads/2019/08/Samosa-Recipe-Step-1.jpg"
        },
        {
          "action": [
            "Press some flour between your palm- it should form a shape (& not crumble) – means oil is enough and well incorporated.\n",
            "Now, start adding water, little by little and mix to form a stiff dough.",
            "Don’t overwork the dough and don’t knead a soft dough. It should just come together and form a stiff dough. I used around 6 tablespoons of water here.\n",
            "Cover the dough with a moist cloth and let it rest for 30 - 40 minutes. I usually soak a paper towel in water and then squeeze out all the water and then cover my dough with that.\n",
            "While the dough is resting, start working on the filling.\n"
          ],
          "image": "https://www.cookwithmanali.com/wp-content/uploads/2019/08/Samosa-Recipe-Step-2.jpg"
        }
      ]
    },
    {
      "make the filling": [
        {
          "action":[ 
            "Peel the skin and boil potatoes until done.\n",
            "Mash the potatoes. Set aside.\n",
            "Heat 2 tablespoons of oil in a pan on medium heat. Once the oil is hot, add thyme, curry, chopped ginger, green chili and chopped spring onion\n",
            "Let the seeds sizzle for few seconds and then add the minced beef or meat or chicken. Cook for 3 minute.\n"
          ],
          "image": "https://www.cookwithmanali.com/wp-content/uploads/2019/08/Samosa-Recipe-Step-3.jpg"
        },
        {
          "action":[  
            "Add the boiled & mashed potatoes and green peas to the pan.\n",
            "Mix everything together.\n",
            "Add the tumeric, red chili powder and salt.\n",
            "Mix to combine. Once it’s all well incorporated, remove pan from heat and let the filling cool down a bit.\n"
          ], 
          "image": "https://www.cookwithmanali.com/wp-content/uploads/2019/08/Samosa-Recipe-Step-4.jpg"
        }
      ]
      },
      {
      "shape and fry samosa": [
        {
          "action":[
            "Once the dough has rested, give it a quick knead. Then divide the dough into 7 equal parts of around 58-60 grams each.\n\nStart working on a piece of dough, keep the remaining dough balls covered at all times with a moist cloth else the dough will dry out.\n",
            "Roll one dough ball into a circle-oval kind of shape, around 6-7 inches in diameter and then cut it into two parts.\n",
            "Take one part and apply water on the straight edge/side. I usually mix some flour with water so that it forms a nice glue.\n",
            "Now bring the two ends of the straight edge together and pinch them to form a cone. See image for a better idea.\n"
          ],
          "image": "https://www.cookwithmanali.com/wp-content/uploads/2019/08/Samosa-Recipe-Step-5.jpg"
        },
        {
          "action":[
            "Pinch the pointed ends to make it a perfect cone shape.\n",
            "Fill the samosa with the potato filling, around 1 to 2 tablespoons. Don’t overfill the samosa.\n",
            "Now again apply water all around the circumference of the cone as you have to seal it. Pinch the opposite side (side opposite to where you pinched to form the cone) to form a plate.\n",
            "Now pinch the edges and seal the samosa.\n"
          ],
          "image": "https://www.cookwithmanali.com/wp-content/uploads/2019/08/Samosa-Recipe-Step-6.jpg"
        },
        {
          "action":[
            "Your samosa is now ready. Repeat with remaining dough. Always remember to keep the filled samosa covered with moist cloth while roll and fill the others.\n",
            "Now heat oil in a deep fryer, pan or pot on low heat. To check if oil is ready, drop a small piece of dough into the oil. It should take few seconds to come up to the surface. That means the oil is ready.\n\nDrop the shaped samosas into the oil.\n",
            "Fry on low heat. After around 10-12 minutes, the samosa will become firm and light brown in color.\n",
            "At this point, increase the heat to medium and fry until it gets nicely browned.\n",
            "Don’t overcrowd the pan, fry 4-5 samosas at a time. And each batch will take around 20 minutes since we fry on low heat so be patient."
          ],
          "image": "https://www.cookwithmanali.com/wp-content/uploads/2019/08/Samosa-Recipe-Step-7.jpg"
        },
        {
          "action": "Once you finish frying one batch, lower the heat again to low and wait until the temperature of the oil drops and then add the second batch.\n\nIf you fry samosa on high heat, they will not get crispy and the dough will remain uncooked. The samosa will also have bubbles on the crust if you oil temperature is hot while frying the samosa."
        }
      ]
    }
  ],
  "notes": [
    "Feel free to customize the filling to your taste but the classic Indian Samosa must contain Irish potatoes and green peas.",
    "Most important thing to remember is to not the fry the samosa on high heat, they will not get crispy if you do so and the dough will remain uncooked. The samosa will also have bubbles on the crust if you oil temperature is hot while frying the samosa.",
    "I have used green peas in my samosa filling. If you are not a fan, simply skip.",
    "This recipes makes 14 medium sized samosa. You can make more or less depending on how you like."
  ],
  "nutrition": [
    {
      "name": "Calories",
      "quantity": "164kcal"
    },
    {
      "name": "Carbohydrates",
      "quantity": "22g"
    },
    {
      "name": "Protein",
      "quantity": "4g"
    },
    {
      "name": "Fat",
      "quantity": "7g"
    },
    {
      "name": "Saturated Fat",
      "quantity": "1g"
    },
    {
      "name": "Sodium",
      "quantity": "183mg"
    },
    {
      "name": "Potassium",
      "quantity": "240mg"
    },
    {
      "name": "Fiber",
      "quantity": "3g"
    },
    {
      "name": "Sugar",
      "quantity": "1g"
    },
    {
      "name": "Vitamin A",
      "quantity": "90IU"
    },
    {
      "name": "Vitamin C",
      "quantity": "9.9mg"
    },
    {
      "name": "Calcium",
      "quantity": "24mg"
    },
    {
      "name": "Iron",
      "quantity": "2.6mg"
    }
  ],
  "bottom image":"https://connectnigeria.com/articles/wp-content/uploads/2017/03/Samosa-B.jpg"
}