{
  "name": "African Salad: Abacha and Ugba",
  "description": "Abacha and Ugba also known as African salad is a Cassava based dish from the Igbo tribe of Eastern Nigeria. Abacha is simply dried shredded Cassava while Ugba on the other hand is fermented African oil bean seed.",
  "top image": "https://cmxpv89733.i.lithium.com/t5/image/serverpage/image-id/877930i013FE2678A76EBF2/image-size/medium?v=1.0&px=400",
  "ingredients": [
    {
      "name": "Abacha",
      "quantity": "4 cups"
    },
    {
      "name": "Ugba",
      "quantity": "2 cups"
    },
    {
      "name": "Palm oil",
      "quantity": "1 cup"
    },
    {
      "name": "Edible Potash (Akaun)",
      "quantity": "1Tsp"
    },
    {
      "name": "Fresh Fish (Titus)",
      "quantity": 1
    },
    {
      "name": "Medium Stock fish (okporoko)",
      "requirement": "Optional"
    },
    {
      "name": "Kanda (Cow skin or Ponmo)",
      "requirement": "Optional"
    },
    {
      "name": "Fresh or Bell Pepper",
      "quantity": 2
    },
    {
      "name": "Onion",
      "quantity": 1
    },
    {
      "name": "Garden Egg",
      "quantity": 1,
      "requirement": "Optional"
    },
    {
      "name": "Utazi Leaves",
      "quantity": "As required"
    },
    {
      "name": "Crayfish",
      "type": "grounded",
      "quantity": "2Tbs"
    },
    {
      "name": "Calabash Nutmeg Seeds (Ehuru)",
      "quantity": 5
    },
    {
      "name": "Locust Beans (Iru or Ogiri)",
      "quantity": "1/2tsp"
    },
    {
      "name": "Seasoning Cubes",
      "quantity": "As required"
    }
  ],
  "steps": [
    {
        "preparations": [
        {
          "action": "Prepare the ehuru seeds by roasting, peeling and grinding them with a dry mill. This is what Calabash nutmeg looks like in case you are wondering",
          "image": "https://sisijemimah.com/wp-content/uploads/2015/12/Abacha-5.jpg"
        },
        {
          "action": "If you will use kanda (cow skin), cook till done and cut into small pieces."
        },
        {
          "action": "Depending on your choice of fish (you can also use all of them) soak the stock fish in water, debone the dry fish and clean and gut your fish, then marinate with salt, curry, bouillon cube or seasoning. Leave to marinate in your fridge or a cool place for at least 30 minutes… Then grill or fry. I prefer grilling, this was grilled for 45 minutes on 220 degrees…",
          "image": ["https://sisijemimah.com/wp-content/uploads/2015/12/Abacha-1.jpg", "https://sisijemimah.com/wp-content/uploads/2015/12/Abacha-2.jpg"]
        },
        {
          "action": "Boil the stock fish with salt and seasoning till soft…",
          "image": "https://sisijemimah.com/wp-content/uploads/2015/12/Abacha-4.jpg"
        },
        {
          "action": "Wash and cut the vegetables into tiny pieces. Cut the big bulb of onion into tiny pieces and cut the medium one in circles. Wash the garden eggs and set aside, no need to cut these but some prefer it sliced."
        },
        {
          "action": "Blend the crayfish, pepper, 1/2 of the onion and ground Ehuru till smooth and set aside….",
          "image": "https://sisijemimah.com/wp-content/uploads/2015/12/Abacha-3.jpg"
        },
        {
          "action": "Soak the Abacha in cold water this should take roughly 10 minutes and rinse the Ugba with lukewarm water to rid it of dirt…",
          "image": "https://sisijemimah.com/wp-content/uploads/2015/12/Abacha-8.jpg"
        },
        {
          "action": "Once the Abacha has softened, put in a sieve to drain.",
          "image": "https://sisijemimah.com/wp-content/uploads/2015/12/Abacha-7.jpg"
        },
        {
          "action": "Put the powdered potash in a cup or bowl and pour about 1 cup of cold water. Stir well and you are ready to start making the African Salad.",
          "image": "https://sisijemimah.com/wp-content/uploads/2015/12/Abacha-6.jpg"
        }
      ]
    },
    {
      "description": "The key to making a good African Salad is to make sure that all the ingredients are well incorporated. As you will see below, there's a lot of add this, stir, add that, stir. You may wonder why you can't just add everything and stir but if you do that, it will be very difficult for you to get a good blend of all the ingredients."
    },
    {
      "action": "Pour the palm oil into a bowl, saucepan sizeable pot. Yes you need all that oil so that your Abacha will not have a dry feel in the mouth when done. Gradually pour the potash mixture into the palm oil, making sure not to pour the sediments (residue at the bottom of the bowl). Mix thoroughly, you’ll notice the palm oil will begin to thicken and the colour will turn yellowy. Now, add the pepper mix with crayfish and into the palm oil…",
      "image": "https://sisijemimah.com/wp-content/uploads/2015/12/Abacha-12.jpg"
    },
    {
      "action": "Now, add the shredded stockfish, Ogiri, Add the diced kanda/pomo and stir very well. Then the Ugba, stir and combine…",
      "image":  "https://sisijemimah.com/wp-content/uploads/2015/12/Abacha-9.jpg"
    },
    {
      "action":  "Then add the drained Abacha and stir till it is well-incorporated in the palm oil paste.",
      "image":  "https://sisijemimah.com/wp-content/uploads/2015/12/Abacha-10.jpg"
    },
    {
      "action": "Add the sliced Utazi and salt to taste and stir well. Some prefer to just garnish with it. Be careful not to add too much Utazi though, it’s quite bitter and will affect the taste of your Abacha if added in excess. It is important that you add salt last because after adding all that seasoning, your Abacha may not even need salt any more.",
      "image": "https://sisijemimah.com/wp-content/uploads/2015/12/Abacha-11.jpg"
    },
    "Garnish with Onion rings, Garden Eggs, Utazi leaves and the Grilled/Fried Fish",
    "And it's ready."
  ],
  "notes": [
    "If you prefer your Abacha warm, do transfer it to a hob and let it simmer on low heat for 2 minutes or heat up in a microwave.",
    "If you like your Abacha cold, after step 4, add the garden egg, stir and serve with garden eggs, fish and onions.."
  ],
  "bottom image": "https://i0.wp.com/www.mydiasporakitchen.com/wp-content/uploads/2018/10/savingpng-16.png?resize=720%2C960&ssl=1"
}