{
  "name": "Ewedu Soup",
  "description": "Ewedu otherwise known as Jute Leaf is a traditional soup native to the Yoruba part of Nigeria. \n\nIt is often served with Amala or any other traditional swallow food like Eba, Pounded yam or Fufu.",
  "top image": "https://www.notion.so/ebosetale/Ewedu-soup-6a21d0ba86564aa6b2dd9b5462ee807e#f84026e71f6d46dfa856222332d60a4b",
  "ingredients": [
    {
      "name": "Jute (Ewedu) leaves",
      "quantity": "As required"
    },
    {
      "name": "Locust Beans (Iru)",
      "quantity": "2Tbs"
    },
    {
      "name": "Crayfish",
      "type": "grounded",
      "quantity": "2Tbs"
    },
    {
      "name": "Salt",
      "requirement": "To taste"
    },
    {
      "name": "Stock Cube",
      "quantity": 1,
      "requirement": "Optional"
    },
    {
      "name": "Seasoning Cube",
      "quantity": 1
    },
    {
      "name": "Egusi",
      "type": "grounded",
      "quantity": "2Tbs",
      "requirement": "Optional"
    }
  ],
  "steps": [
    "You can either buy fresh ewedu leaves this means that you have to pick the leaves from the stem, as you only need the leaves. Or you can buy the frozen leaves from the Asian/ African grocery shop, this would have been picked. Place water in a pot to boil while you wash the ewedu.",
    "Pour in the washed ewedu leaves and leave to continue boiling in the water, until soft.",
    "Check to see if the leaves have soften, then, pour this in the blender and use the pulse button \"P\" a couple of times to chop the leaves, you don't want this all smooth.",
    "Pulse a few time until thoroughly chopped but not smooth.",
    "Pour the soup back in the pot and place back on heat, add the iru (locust beans)",
    "Add some cray fish, it better to use the ground crayfish. Add 2 tablespoon of grounded egusi (grounded melon seeds, this is optional) you can have it plain if you prefer.",
    "Add salt, stock cube and seasoning cube to taste."
  ],
  "notes": [
    "You need to be fast as possible so the the soup still maintains its greens and still drawy. The beauty of ewedu is in its drawiness.",
    "Ewedu is usually paired with its twin sister \"Gbegiri\" and eaten along with Amala. It was once said that if yoruba people were to have their own flag it will be in the colours of these 2 soup, \"Ewedu & Gbegiri\"",
    "Ewedu is a very rich source of folic acid. In recent times, the health benefits of ewedu has come to light, it has been known to include vitamins such Vitamin A, B & C and high in fibre."
  ],
  "nutrition": [
    {
      "name": "Calories",
      "quantity": "7kcal"
    },
    {
      "name": "Carbohydrates",
      "quantity": "1g"
    },
    {
      "name": "Protein",
      "quantity": "1g"
    },
    {
      "name": "Fat",
      "quantity": "1g"
    },
    {
      "name": "Cholesterol",
      "quantity": "8mg"
    },
    {
      "name": "Sodium",
      "quantity": "198mg"
    },
    {
      "name": "Potassium",
      "quantity": "14kg"
    },
    {
      "name": "Sugar",
      "quantity": "1g"
    },
    {
      "name": "Calcium",
      "quantity": "3mg"
    },
    {
      "name": "Iron",
      "quantity": "0.1mg"
    }
  ],
  "bottom image": "https://www.notion.so/ebosetale/Ewedu-soup-6a21d0ba86564aa6b2dd9b5462ee807e#01e2cb7836c047738080afcf696f0600"
}