{
  "name": "Tuwo Shinkafa",
  "description": "Tuwo Shinkafa (Rice Fufu) is a northern Nigerian fufu recipe that is prepared with the soft rice variety. It is usually served with Northern Nigerian soups: Miyan Kuka, Miyan Taushe etc. It goes well with other Nigerian Soups. The rice used for Tuwo Shinkafa should be the a soft rice variety that becomes sticky when cooked. This is so that the grains can be easily mashed to make a mass of fufu (tuwo).",
  "top image": "https://www.notion.so/ebosetale/Tuwo-Shinkafa-0dedee55bf4e4c90aa72b2eb7fde3c92#2bc7edab0cc84cc58a0f68cd50648d1c",
  "ingredients": [
    {
      "name": "Rice",
      "quantity": "As required",
      "type": "Soft"
    },
    {
      "name": "Water",
      "quantity": "As required"
    }
  ],
  "steps": [
    {
      "preparations": [
        "Rinse the rice in cold water and put in a sizeable pot."
      ]
    },
    "Pour just enough water to cover the rice and start cooking at medium heat.",
    "When the first dose of water dries up, check the rice by mashing it between your fingers. If the rice grains have even a tiny resistance when you press them, then it needs to be cooked some more.",
    "Reduce the heat to low, add a little bit more water and continue cooking till the water dries.",
    "Repeat the process till the rice is so soft that it melts when you press on it.",
    "Once you're happy, mash the rice with a wooden spatula by moving the rice in small quantities from the far end of the pot to your side of the pot.",
    "Fold the mound of tuwo and repeat till all the rice grains have turned into a mass of tuwo.",
    "Cover and leave it to steam for about 2 minutes.",
    "Mix thoroughly and dish serving quantities onto a thin plastic film and wrap them up. This wrapping prevents the tuwo from drying up"
  ],
  "notes": [
    "You can also serve them in smaller balls and with any soup:"
  ],
  "bottom image": "https://www.notion.so/ebosetale/Tuwo-Shinkafa-0dedee55bf4e4c90aa72b2eb7fde3c92#c35f581a921e4742b5f6c619998a2626"
}