{
  "name": "Scrambled Eggs",
  "description": "Scrambled eggs is a dish made from eggs (usually chicken eggs) stirred or beaten together while being gently heated, typically with salt, butter and sometimes other ingredients.",
  "top image": "https://thecookful.com/wp-content/uploads/2019/04/Hard-Scrambled-Eggs-1392x780.jpg",
  "ingredients": [
    {
      "name": "Eggs",
      "quantity": 4
    },
    {
      "name": "Whole Milk",
      "quantity": "1tbs"
    },
    {
      "name": "Cheese",
      "type": "Shredded or Crumbled",
      "requirement": "Optional"
    },
    "Salt",
    "Pepper",
    "Nonstick cooking oil spray, olive oil, or butter, or a combination"
  ],
  "notes": "You will also need: Bowl, fork or whisk, medium nonstick skillet",
  "steps": [
    {
      "description": "This recipe makes 2 servings, 2 eggs each (4 total), in a medium-sized nonstick skillet.  For a small skillet, try 2 eggs at a time. If you have a very large skillet (over 11\"), try 6 at a time. Always use a skillet with a nonstick coating or a well-seasoned cast iron pan for best results."
    },
    {
      "action": "If you plan on adding cheese to your eggs, make sure that the cheese is shredded/prepared and set aside so you can add it to the skillet quickly. Place your skillet on the stovetop and turn on the heat between medium low and medium, so it warms up but doesn't get too hot.",
      "image": "https://toriavey.com/images/2014/06/IMG_0064.jpg"
    },
    {
      "action": "Meanwhile, prepare your eggs. Break them into a bowl with a tablespoon of water or milk, some salt and pepper. I use about 1/8 tsp salt and a pinch of pepper; you might use more or less according to taste. If you're dairy intolerant or don't like the taste of milk you can use water. Milk enhances the flavor of the eggs.",
      "image": "https://toriavey.com/images/2014/06/IMG_0069.jpg"
    },
    {
      "action": "Use a fork or whisk to beat the eggs briskly for 30-60 seconds, making sure the eggs are fully broken up and mixed well with the milk and the seasonings. Use a little elbow grease here, the more you whip it the better.",
      "image": "https://toriavey.com/images/2014/06/IMG_0074.jpg"
    },
    {
      "action": "Lightly grease your hot skillet, coating the surface with a thin layer of oil or butter (or a combination of oil and butter). If using spray oil, use caution and keep it away from any open gas flames.",
      "image": "https://toriavey.com/images/2014/06/IMG_0159.jpg"
    },
    {
      "action": "Pour the eggs into the skillet. Keep the heat on medium/medium low, you don't want to rush it here-- if the skillet is too hot the eggs will cook too quickly and become rubbery. Once you pour the eggs in they will begin to cook immediately. Using a spatula (I use a wooden or silicone spatula so I won't damage my pan's nonstick coating), begin pulling the cooked outer edges in towards the center of the eggs. Uncooked eggs will flood the area you just pulled back. If you are adding cheese, now is the time to sprinkle it into the skillet. This will allow ample time for the cheese to melt and integrate into the eggs.",
      "image": "https://toriavey.com/images/2014/06/IMG_0162.jpg"
    },
    {
      "action": "Move the spatula around the edge of the skillet, pulling the cooked edges towards the center and re-flooding repeatedly. Cooked scrambled eggs will gather in the center of the skillet.",
      "image": "https://toriavey.com/images/2014/06/IMG_0168.jpg"
    },
    {
      "action": "At a certain point, the uncooked eggs will no longer flood and the scramble will all collect in the center of the skillet, but it will still be slightly runny in texture. Begin breaking up the scramble; quickly turn undercooked areas and keep the scramble moving to make sure that all surfaces cook evenly. Never leave a surface in contact too long with the skillet or it will become overcooked.",
      "image": "https://toriavey.com/images/2014/06/IMG_0171.jpg"
    },
    {
      "action": "Turn off the heat when the eggs are 90% cooked. When the eggs are done, serve immediately. Perfectly cooked scrambled eggs are moist but not runny, with no crisp or brown edges. This technique may take a bit of practice, but it is quite simple. With time you too will be making and serving moist, fluffy scrambled eggs!"
    }
  ],
  "bottom image": "https://miro.medium.com/max/5976/1*wa_Qp1pbFZPRKH547zjcnA.jpeg"
}